Repository: 84000/data-translation-memory
Catalog: toh314_84000-entry-into-the-gloomy-forest.tmx
Source language: bo
Languages: en

source: མུན་གྱི་ནགས་ཚལ་གྱི་སྒོ་ཞེས་བྱ་བའི་མདོ།
en: The Sūtra Entry into the Gloomy Forest

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas!

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་མཉན་དུ་ཡོད་པ་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན་བཞུགས་ཏེ།
en: The Blessed One was staying in Śrāvastī at Jeta Grove, in the garden of Anāthapiṇḍada.

source: དེ་ནས་དེའི་ཚེ་ངམ་གྲོག་གསུམ་པོ་ཞེས་བྱ་བའི་ལྗོངས་ཀྱི་སྐྱེ་བོ་དག་གི་ནང་ནས་རི་ཁྲོད་ཀྱི་གྲོང་ཞིག་ན།
en: At that time there was a brahmin named Kambala from a mountain village in the country known as Trigarta.

source: བྲམ་ཟེ་ལ་བ་ཅན་ཞེས་བྱ་བ་སྤུན་བུ་འདོད་པའི་ཕྱིར་བྲམ་ཟེའི་རྡོ་ལེབ་ལ་དཀའ་ཐུབ་བྱེད་དེ།ལྷ་སྟོང་ཕྲག་བརྒྱ་ལ་བུ་སློང་ཞིང་གསོལ་བ་འདེབས་པ་དང་ལ་བ་ཅན་ལ་བུ་བཙས་པ་ནི་མིང་རབ་མཐོང་ཞེས་བཏགས་སོ།
en: Desiring a son for himself and his kinsmen, Kambala undertook austerities at a place called Brahmin’s Flat Stone. After praying to one hundred thousand gods for a son, he eventually had a boy whom he called Pradarśa.

source: །ནུ་བོ་ལ་བཙས་པ་ནི་དགའ་བོ་ཞེས་བཏགས་སོ།
en: To his brother was born another boy, who was called Nanda.

source: །གང་གི་ཉིན་མོ་རབ་མཐོང་བཙས་པ་དེའི་ཉིན་མོ་བྲམ་ཟེ་ལྔ་བརྒྱ་ལ་བུ་ལྔ་བརྒྱ་བཙས་ཏེ།
en: On the very day Pradarśa was born, five hundred sons were born to five hundred brahmins.

source: དེ་དག་རིམ་བཞིན་དུ་བུ་ཆེར་སྐྱེས་པ་དང་། རབ་མཐོང་ལ་སོགས་པ་ལྔ་བརྒྱ་ལྷན་ཅིག་ཏུ་རིག་པ་དག་སློབ་པ་ན།
en: As they gradually grew older, Pradarśa and the five hundred other boys trained together in the traditional subjects of learning.

source: རབ་མཐོང་ལ་སོགས་པ་རིག་པའི་གནས་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་སོན་ཅིང་ཐམས་ཅད་རྫོགས་པར་ཡང་དག་པར་བྱང་བར་གྱུར་ལ། བསོད་ནམས་ཀྱི་ཚོགས་ཡང་དག་པ་ལས་བྱུང་བའི་སྤྱོད་པ་མཚུངས་པ་མེད་པ་སྟོང་ཕྲག་བརྒྱ་སྙེད་ཐོབ་སྟེ།
en: Soon Pradarśa and the others attained mastery and dexterity in all fields of learning, and they obtained a hundred thousand exceptional enjoyments due to their perfect accumulations of merit.

source: དབང་བྱེད་པ་གང་གི་དུས་སུ་བྲམ་ཟེ་མ་ཎ་བ་གཅིག་ཡུལ་དབུས་ནས་འོངས་ཏེ་ཕྱིན་ནས་ཕྲད་པ་དང་། དེ་ལ་གསོང་པོར་སྨྲས་ཏེ་གཏམ་དག་ཀྱང་བྱས་ནས་ངེས་པར་གང་ནས་འོངས་པ་ཡིན་ཞེས་དྲིས་པ་དང་། དེས་སྨྲས་པ་ཡུལ་དབུས་ནས་འོངས་པ་ཡིན་ཏེ་དེ་ཡང་གྲོང་ཁྱེར་ཆེན་པོ་དྲུག་གོ།
en: At that time, a brahmin youth arrived from the Middle Country and encountered the boys. Welcoming him, the boys struck up a conversation and asked, “So, where have you arrived from?” “I’m from the Middle Country,” he replied.

source: །དེའི་ནང་དག་ན་ཚད་མ་དྲུག་ལ་མཁས་ཤིང་ལྟས་ཀྱི་བྱ་བ་དྲུག་ལ་ཐོགས་པ་མེད་པར་བརྗོད་ནུས་པའི་སྟོན་པ་བཅོ་བརྒྱད་ཡོད་དེ་དེ་ན་ཆུ་ཀླུང་ཡང་འབབ་བོ།
en: “There we have six great cities, and in them we have eighteen teachers who are experts in the six correct forms of knowledge and who can lecture without any reticence on the six activities of a brahmin. There is also a river there.

source: །དེ་མ་ཡིན་པ་བསོད་ནམས་ཆེན་པོ་དང་ལྡན་པ། དགེ་ཞིང་ཤིས་པ། འཇིག་རྟེན་ཐམས་ཅད་མཁྱེན་པ།
en: Additionally, there is someone with a great amount of merit who is virtuous and glorious and who knows everything about the world—he is the blessed Buddha.”

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱང་དེ་ནའོ་ཞེས་བྱས་པ་དང་། རབ་མཐོང་གིས་སྒྲ་དེ་ཐོས་པ་དང་། བ་སྤུ་ལངས་ཡིད་གཡོས་རབ་ཏུ་དགའ་སྟེ་དེར་འགྲོའོ་སྙམ་ནས།
en: As soon as Pradarśa heard this, his hair bristled and his mind became overjoyed.

source: ཕའི་གན་དུ་སོང་སྟེ་ཕྱིན་ནས་ཡབ་བདག་ནི་ཡུལ་དབུས་སུ་མཆིའོ། །དེ་ནས་མུ་སྟེགས་པ་དག་ལས་རྒྱལ་བར་བགྱིའོ།
en: Thinking that he must go there, he approached his father and announced, “Father, I will go to the Middle Country.

source: །མཁས་པར་བགྲངས་པ་དག་དང་ངེས་པར་ལྷན་ཅིག་སྨྲ་བར་བགྱིའོ་ཞེས་གསོལ་པ་དང་། ཕས་དེ་ལྟར་གནང་ངོ་།
en: I will defeat those with heretical views and debate those regarded as experts.” His father granted him permission.

source: །དེ་ནས་བསོད་ནམས་ཆེན་པོ་སྦྱིན་པས་དབང་ཕྱུག་ཆེན་པོ་དང་ལྡན་པ།
en: Pradarśa possessed a majestic presence due to the great merit resulting from generosity, and he was exceedingly generous toward all beings.

source: སེམས་ཅན་ཐམས་ཅད་ལ་གཏོང་བ་ཆེན་པོ་ཅན་དེ་ལྷ་དག་གིས་བསྲུངས་པ་ཞིག་པས་ལྷ་དག་ཉེ་བར་འོང་ཞིང་སྔོན་དུ་འགྲོ་སྟེ།
en: He was a person protected by the gods. Accordingly, the gods approached him and went ahead to announce, “You must worship the great Pradarśa!

source: རབ་མཐོང་ཆེན་པོ་ལ་མཆོད་པ་བྱོས་ཤིག་དང་། ཕན་ཡོན་མང་པོ་དག་གི་འབྲས་བུ་ཆེན་པོ་འབྱུང་བར་འགྱུར་རོ།
en: It will bring you great results in the form of many benefits!”

source: །ཞེས་སྒྲ་སྒྲོགས་ཤིང་སོང་བ་དང་། རིམ་གྱིས་ལྷ་དང་མིས་མཆོད་པ་བྱས་ཤིང་མཉན་ཡོད་དུ་ཕྱིན་ནོ།
en: In turn, with gods and humans worshiping him, Pradarśa arrived at Śrāvastī.

source: །དེ་ནས་ལམ་གྱིས་དུབ་པ་རྟ་བསྟིས་ཏེ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: Having recuperated from the fatigue of his journey, he went to where the Blessed One was dwelling and, bowing his head at the feet of the Blessed One, took his place to one side.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་ཆོས་བསྟན་པ་མཛད་དེ།
en: The Blessed One then taught the Dharma to Pradarśa and the rest of the assembly.

source: དེའི་འཁོར་ལྔ་བརྒྱ་པོ་དག་ལྟ་བ་མཆོག་ཏུ་འཛིན་པ་བཤིག་བཅོམ་སྟེ། བདེན་པ་མཐོང་སྟེ་དེ་ཉིད་དུ་རབ་ཏུ་བྱུང་དགེ་སློང་གི་དངོས་པོ་བཟུང་སྟེ།
en: All five hundred members of the assembly had their clinging to false views undermined and destroyed, and seeing the truth, they went forth and took up monkhood on the spot.

source: ཉོན་མོངས་པ་ཐམས་ཅད་བཅོམ་ནས་དགྲ་བཅོམ་པ་མངོན་དུ་བྱས་ཏེ་དགའ་བོ་ནི་མ་གཏོགས་སོ།
en: Apart from Ānanda, they all vanquished their mental afflictions and became worthy ones.

source: །སྐྱེ་བོ་མང་པོ་ཀུན་གྱིས་ཀྱང་ཆོས་ཁོང་དུ་ཆུད་དོ།
en: A multitude of other people also came to understand the Dharma.

source: །སྟོན་པ་ཆེན་པོ་རབ་མཐོང་ལྟ་བའི་ཕྱིར་ལྷ་ལ་སོགས་པ་དག་ཀྱང་འོངས་ཏེ་དེར་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ།
en: Because they had been observing the generous Pradarśa, the gods and others also arrived in the assembly.

source: དགེ་སློང་དག་དགེ་སློང་རབ་མཐོང་འདི་ནི་ངའི་དགེ་སློང་དང་དགེ་སློང་དག་གི་ཉན་ཐོས་དག་ལ་ཇི་ལྟར་ལྷ་དང་མི་མཆོད་པ་བྱེད་པ་དེ་དག་གི་ནང་ན་ལྷ་དང་མིས་མཆོད་པར་བྱ་བའི་མཆོག་ནི་དགེ་སློང་རབ་མཐོང་ཡིན་ནོ་ཞེས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་ཏོ།
en: Upon their arrival, the Blessed One said to the monks, “Monks, among my monks and the hearers who are monks—however they may be worshiped by gods and humans—the monk Pradarśa is the supreme object of worship by gods and humans!”

source: །དེ་ནས་དུས་དེ་ཉིད་དུ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་། ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་དང་། འཇིག་རྟེན་སྐྱོང་བ་བཞི་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཉི་ཤུ་རྩ་བརྒྱད་དང་། དྲི་ཟའི་རྒྱལ་པོ་དང་། གྲུལ་བུམ་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལ་སོགས་པ་རང་རང་གི་གནས་ནས་སོང་སྟེ།
en: Immediately thereupon, Brahmā, the lord of the Sahā world; Śakra, chief of the gods; the Four Guardians of the World; the twenty-eight great yakṣa generals; the king of gandharvas; the general of the kumbhāṇḍas; and others departed from their respective abodes and arrived before the venerable great Pradarśa.

source: ཚེ་དང་ལྡན་པ་རབ་མཐོང་ཆེན་པོ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དེ་མངོན་དུ་ཕྱོགས་ཐལ་མོ་སྦྱར་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Taking their places to one side, they faced Pradarśa, joined their hands, and said, “Honorable great Pradarśa!

source: །ཀྱེ་བཙུན་པ་རབ་མཐོང་ཆེན་པོ་སྔོན་གྱི་བཅོམ་ལྡན་འདས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གཤེགས་ཤིང་བཞུགས་པའི་གནས་རང་སངས་རྒྱས་ཀྱི་བཞུགས་གནས།
en: There is an abode that was visited and inhabited by previous blessed, perfect buddhas.

source: འདོད་ཆགས་དང་བྲལ་བ་དག་གིས་གནས་པར་བྱ་བ་དྲང་སྲོང་གི་གནས་སུ་གྱུར།
en: It was an abode for solitary buddhas, a place for those devoid of desire, and an abode for sages.

source: དེ་ཁོ་ན་ཉིད་ངེས་པར་མཁྱེན་ནས་འདས་པའི་བསྐལ་པ་དགུ་བཅུ་རྩ་གཅིག་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: Ninety-one eons ago, the perfect Buddha Vipaśyin, having ascertained the nature of things, appeared in the world.

source: དེའི་ཚེ་དགེ་སློང་གསལ་བ་ཞེས་བྱ་བ་ལྷ་དང་མིས་མཆོད་པའི་མཆོག་ཏུ་གྱུར་པ་དེའི་གནས་ཀྱང་འདི་ལགས་ཏེ།
en: At that time, there was a monk named Shining, who was the most highly revered by gods and humans. He also resided in this place.

source: ཡུལ་དབུས་ལས་བྱང་ཕྱོགས་ཀྱི་ས་མཚམས་ཀྱི་རི་དུང་གི་ལྟེ་བ་ཞེས་བྱ་བ་ནི་རི་དེ་ལ་རྩྭའི་རིགས་དུང་གི་ལྟེ་བ་འདྲ་བ་སྐྱེ་བས་དུང་གི་ལྟེ་བའི་རི་ཞེས་བྱ་བར་བཏགས་པར་གྱུར། རི་དེ་དང་ཉེ་བ་ན་ནགས་ཤིག་ན་ཀླུ་མོ་ཨེ་ནི་ཞེས་བྱ་བ་གནས་པས་ཨཻ་ནིའི་ནགས་ཞེས་བྱ་བར་བཏགས་པར་གྱུར།
en: On the northern border of the Middle Country, there was Mount Conch Spire, so called because on it grew grass that resembled the spire of a conch. Nearby was the Eni Forest, so called because the nāga lady Eni resided therein.

source: དེ་ན་ཕུག་ཅིག་ཡོད་པ་དང་ཉེ་བར་ཤིང་པ་ཏི་ལི་ཞེས་བྱ་བ་སྐྱེ་བས་པ་ཏི་ལིའི་ཕུག་ཅེས་བཏགས་པར་གྱུར་པ་དེ་ཉིད་དུ་བཅོམ་ལྡན་འདས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་ཞེས་བྱ་བ།
en: In that forest there were caves around which trumpet flower trees grew, and so they were called Pāṭalī Caves.

source: འཁོར་དགྲ་བཅོམ་པ་བརྒྱད་ཁྲི་དང་གཤེགས་ཤིང་ཐབས་ཅིག་ཏུ་བཞུགས་པར་གྱུར།
en: It was there that the blessed, perfect Buddha Vipaśyin arrived and resided along with his retinue of eighty thousand worthy ones.

source: དགེ་སློང་གསལ་བ་ཡང་དེ་ཉིད་ནའོ།
en: The monk Shining was also there.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་འཁོར་དང་བཅས་པ་དག་ཀྱང་རིམ་པ་བཞིན་དུ་མྱ་ངན་ལས་འདས།
en: Then the Blessed One and his retinue gradually passed into nirvāṇa.

source: བསྟན་པ་ནུབ་ནས་རང་སངས་རྒྱས་བདུན་ཁྲི་དག་མངོན་པར་ཤེས་པ་དྲུག་དང་ལྡན་པ་དག་མཉམ་དུ་བྱུང་སྟེ་གཤེགས་ཤིང་བཞུགས་པར་གྱུར།
en: Once his teaching had disappeared, seventy thousand solitary buddhas who were endowed with the six forms of superknowledge arrived and resided together.

source: རང་སངས་རྒྱས་དེ་དག་ཀྱང་མྱ་ངན་ལས་འདས་ནས་དྲང་སྲོང་དྲུག་ཁྲི་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་དག་ཀྱང་དེ་ཉིད་དུ་གནས་པར་གྱུར་ཏོ།
en: When those solitary buddhas had also passed into nirvāṇa, sixty thousand sages who were endowed with the five forms of superknowledge came to inhabit that same place.

source: །བཙུན་པ་རབ་མཐོང་ཆེན་པོ་དེ་ནས་ཡང་བསྐལ་པ་དྲུག་ཅུ་རྩ་གཅིག་ན་བཅོམ་ལྡན་འདས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གཙུག་ཏོར་ཅན་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: “Honorable great Pradarśa, thereafter, sixty-one eons ago, the blessed, perfect Buddha Śikhin appeared in the world.

source: དེའི་དགེ་སློང་རབ་གསལ་ཞེས་བྱ་བ་ལྷ་དང་མིས་མཆོད་པའི་མཆོག་ཏུ་གྱུར་པ་ཡང་དེ་ཉིད་ནའོ།
en: His monk named Luminosity, who was the most highly revered by gods and humans, also resided in that very place.

source: །མཚམས་ཀྱི་རི་དེ་ཉིད་ལ་རྩྭའི་རིགས་རོ་ཧི་ཏཱི་ཞེས་བྱ་བ་སྐྱེ་བས་རོ་ཧི་ཏཱིའི་རི་ཞེས་བྱ་བར་བཏགས་པར་གྱུར།
en: Because the bordering mountain had rohita grass growing on it, it was called Mount Rohita.

source: ཀླུ་མོ་གོས་མེད་ཅེས་བྱ་བ་གནས་པས་གོས་མེད་ཀྱི་ནགས་ཞེས་བྱ་བར་བཏགས་པར་གྱུར།
en: The forest was called Unclothed Forest because the nāga lady Unclothed resided there.

source: ཤིང་ཤིར་ཤ་སྐྱེ་བས་ཤིང་ཤིར་ཤའི་ཕུག་ཅེས་བཏགས་པར་གྱུར།
en: Because parrot trees grew nearby, the caves were called Parrot Tree Caves.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གཙུག་ཏོར་ཅན་འཁོར་དགྲ་བཅོམ་པ་བདུན་ཁྲི་དང་ཡང་དེར་གཤེགས་ཤིང་ཐབས་ཅིག་ཏུ་བཞུགས་པར་གྱུར།
en: It was there that the perfect Buddha Śikhin, along with his retinue of seventy thousand worthy ones, arrived and resided together.

source: དེ་དག་ཀྱང་མྱ་ངན་ལས་འདས་བསྟན་པ་ནུབ་ནས།
en: They too passed into nirvāṇa, and the teaching disappeared.

source: རང་སངས་རྒྱས་དྲུག་ཁྲི་ཡང་དེར་གཤེགས་ཤིང་བཞུགས་པར་གྱུར།
en: Then, sixty thousand solitary buddhas arrived and resided in that place.

source: རང་སངས་རྒྱས་དེ་དག་ཀྱང་མྱ་ངན་ལས་འདས་ནས་དྲང་སྲོང་ལྔ་ཁྲི་ཡང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་དེ་འདི་ཉིད་ན་གནས་པར་གྱུར་ཏོ།
en: When those solitary buddhas had also passed into nirvāṇa, fifty thousand sages who were endowed with the five forms of superknowledge came to inhabit that same place.

source: །བཙུན་པ་རབ་མཐོང་ཆེན་པོ་དེ་ནས་ཡང་བསྐལ་པ་སུམ་ཅུ་རྩ་གཅིག་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐམས་ཅད་སྐྱོབ་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: “Honorable great Pradarśa, thereafter, thirty-one eons ago, the perfect Buddha Viśvabhū appeared in the world.

source: དེའི་དགེ་སློང་ཆོས་གསལ་ཞེས་བྱ་བ་ལྷ་དང་མིས་མཆོད་པའི་མཆོག་ཏུ་གྱུར་པ་ཡང་དེ་ཉིད་ནའོ།
en: His monk named Shining Forth Dharma, who was the most highly revered by gods and humans, also resided in that very place.

source: །མཚམས་ཀྱི་རི་དེ་ལ་རྩྭ་རིགས་བྷ་ས་བྷ་ས་ཞེས་བྱ་བ་སྐྱེ་བས་བྷ་ས་བྷའི་རི་ཞེས་བཏགས་པར་གྱུར།
en: Because the bordering mountain had bhasabha grass growing on it, it was called Mount Bhasabha.

source: ཀླུ་མོ་བྲག་ཅེས་བྱ་བ་གནས་པས་བྲག་གི་ནགས་ཞེས་བཏགས་པར་གྱུར།
en: The forest was called Rock Forest because the nāga lady Rock resided there.

source: ཤིང་ཨ་ཤྭད་ཐ་སྐྱེ་བས་ཨ་ཤྭད་ཐའི་ཕུག་ཅེས་བཏགས་པར་གྱུར།
en: Because pipal trees grew nearby, the caves were called Pipal Tree Caves.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐམས་ཅད་སྐྱོབ་འཁོར་དགྲ་བཅོམ་པ་དྲུག་ཁྲི་དང་དེ་ཉིད་དུ་གཤེགས་ཤིང་ཐབས་ཅིག་ཏུ་བཞུགས་པར་གྱུར།
en: It was there that the perfect Buddha Viśvabhū, along with his retinue of sixty thousand worthy ones, arrived and resided together.

source: དེ་དག་མྱ་ངན་ལས་འདས་བསྟན་པ་ནུབ་ནས་རང་སངས་རྒྱས་ལྔ་ཁྲི་ཡང་གཤེགས་ཤིང་བཞུགས་པར་གྱུར།
en: They too passed into nirvāṇa, and the teaching disappeared. Then, fifty thousand solitary buddhas also arrived and resided there.

source: རང་སངས་རྒྱས་དེ་དག་ཀྱང་མྱ་ངན་ལས་འདས་ནས་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་བཞི་ཁྲི་ཡང་གནས་པར་གྱུར་ཏོ། །འདིར་ནི་བཙུན་པ་རབ་མཐོང་ཆེན་པོ་སྔོན་བྱུང་བ་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་བཞི་ཁྲི་ཐུབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལོག་པར་དད་སེལ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: When those solitary buddhas had also passed into nirvāṇa, forty thousand sages who were endowed with the five forms of superknowledge came to inhabit the place. “Here, honorable great Pradarśa, during this very Excellent Eon when the lifespan of humans was forty thousand years, the perfect Buddha Krakucchanda appeared in the world.

source: དེའི་དགེ་སློང་ཆོས་ལྡན་ཞེས་བྱ་བ་ལྷ་དང་མིས་མཆོད་པའི་མཆོག་ཏུ་གྱུར་པ་ཡང་དེ་ཉིད་ནའོ།
en: His monk named Dharma Endowed , who was the most highly revered by gods and humans, also resided in that very place.

source: །མཚམས་ཀྱི་རིའི་རྩྭའི་རིགས་ཀཽ་ཤི་ཀ་ཞེས་བྱ་བ་སྐྱེ་བས་ཀཽ་ཤི་ཀའི་རི་ཞེས་བཏགས་པར་གྱུར།
en: Because the bordering mountain had kauśika grass growing on it, it was called Mount Kauśika.

source: སྤྲིན་ཅེས་བྱ་བའི་ཀླུ་མོ་གཅིག་གནས་པས་སྤྲིན་གྱི་ནགས་ཞེས་བཏགས་པར་གྱུར།
en: The forest was called Cloud Forest because a nāga lady named Cloud resided there.

source: ཤིང་ཨུ་དུམ་བ་ར་སྐྱེ་བས་ཨུ་དུམ་པཱ་རའི་ཕུག་ཅེས་བཏགས་པར་གྱུར།
en: Because the cluster fig tree grew nearby, the caves were called Cluster Fig Caves.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལོག་པར་དད་སེལ་འཁོར་དགྲ་བཅོམ་པ་ལྔ་ཁྲི་དང་ཐབས་ཅིག་ཏུ་གཤེགས་ཤིང་ཞུགས་པར་གྱུར།
en: It was there that the perfect Buddha Krakucchanda, along with his retinue of fifty thousand worthy ones, arrived and resided together.

source: དེ་དག་ཀྱང་མྱ་ངན་ལས་འདས་ནས་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་དྲང་སྲོང་སུམ་ཁྲི་ཡང་དེ་ན་གནས་པར་གྱུར་ཏོ།
en: They too passed into nirvāṇa, and thirty thousand sages who were endowed with the five forms of superknowledge came to inhabit the place.

source: །འདིར་ནི་བཙུན་པ་རབ་མཐོང་ཆེན་པོ་སྔོན་བྱུང་བ་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་སུམ་ཁྲི་ཐུབ་པ་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་ཐུབ་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: “Here, honorable great Pradarśa, during this very Excellent Eon when the lifespan of humans was thirty thousand years, the perfect Buddha Kanakamuni appeared in the world.

source: དེའི་དགེ་སློང་ཆོས་འཕགས་ཞེས་བྱ་བ་ལྷ་དང་མིས་མཆོད་པའི་མཆོག་ཏུ་གྱུར་པ་ཡང་དེ་ཉིད་ནའོ།
en: His monk named Uplifted by Dharma, who was the most highly revered by gods and humans, also resided in that very place.

source: །མཚམས་ཀྱི་རི་དེ་ལ་རྩྭའི་རིགས་ཁ་དོག་ལྗང་ལོ་ཅན་ཞེས་བྱ་བ་སྐྱེ་བས་ཁ་དོག་ལྗང་ལོ་རི་ཞེས་བཏགས་པར་གྱུར།
en: Because the bordering mountain had green leafy grass growing on it, it was called Mount Leafy Green.

source: ཐིག་ལེ་ཞེས་བྱ་བའི་ཀླུ་མོ་གནས་པས་ཐིག་ལེའི་ནགས་ཞེས་བཏགས་པར་གྱུར།
en: The forest was called Drop Forest because the nāga lady named Drop resided there.

source: ཤིང་ཀ་པི་ཏ་སྐྱེ་བས་ཀ་པི་ཏའི་ཕུག་ཅེས་བཏགས་པར་གྱུར།
en: Because elephant trees grew nearby, the caves were called Elephant Tree Caves.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་ཐུབ་འཁོར་དགྲ་བཅོམ་པ་བཞི་ཁྲི་དང་གཤེགས་ཤིང་ཐབས་ཅིག་ཏུ་བཞུགས་པར་གྱུར།
en: It was there that the perfect Buddha Kanakamuni, along with his retinue of forty thousand worthy ones, arrived and resided together.

source: རང་སངས་རྒྱས་སུམ་ཁྲི་ཡང་གཤེགས་ཤིང་བཞུགས་པར་གྱུར།
en: Then, thirty thousand solitary buddhas arrived and resided there.

source: རང་སངས་རྒྱས་དེ་དག་ཀྱང་མྱ་ངན་ལས་འདས་ནས་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་དྲང་སྲོང་ཉི་ཁྲི་ཡང་དེ་ཉིད་ན་གནས་པར་གྱུར་ཏོ།
en: When those solitary buddhas had also passed into nirvāṇa, twenty thousand sages who were endowed with the five forms of superknowledge came to inhabit that same place.

source: །འདིར་ནི་བཙུན་པ་རབ་མཐོང་ཆེན་པོ་སྔོན་བྱུང་བ་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: “Here, honorable great Pradarśa, during this very Excellent Eon when the lifespan of humans was twenty thousand years, the perfect Buddha Kāśyapa appeared in the world.

source: དེའི་དགེ་སློང་ཤེ་ཌོ་ཀ་ཞེས་བྱ་བ་ལྷ་དང་མིས་མཆོད་པའི་མཆོག་ཏུ་གྱུར་པ་ཡང་དེ་ཉིད་ནའོ།
en: His monk named Śeḍoka, who was the most highly revered by gods and humans, also resided in that very place.

source: །མཚམས་ཀྱི་རི་ལ་རྩྭའི་རིགས་ཟླ་བ་ཞེས་བྱ་བ་སྐྱེ་བས་ཟླ་བའི་རི་ཞེས་བཏགས་པར་གྱུར།
en: Because the bordering mountain had a type of grass named moon growing on it, it was called Mount Moon.

source: ཀླུ་མོ་རྒྱལ་བ་ཞེས་བྱ་བ་གནས་པས་རྒྱལ་བའི་ནགས་ཞེས་བྱ་བར་བཏགས་པར་གྱུར།
en: The forest was called Victorious Forest because the nāga lady Victorious resided there.

source: ཤིང་འཛམ་བུ་ཞེས་བྱ་བ་སྐྱེ་བས་འཛམ་བུའི་ཕུག་ཅེས་བཏགས་པར་གྱུར།
en: Because black plum trees grew nearby, the caves were called Black Plum Caves.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་འཁོར་དགྲ་བཅོམ་པ་ཉི་ཁྲི་དང་གཤེགས་ཤིང་ཐབས་ཅིག་ཏུ་བཞུགས་པར་གྱུར།
en: It was there that the perfect Buddha Kāśyapa, along with his retinue of twenty thousand worthy ones, arrived and resided together.

source: རང་སངས་རྒྱས་ཁྲི་ལྔ་སྟོང་གཤེགས་ཤིང་བཞུགས་པར་གྱུར།
en: Then, fifteen thousand solitary buddhas arrived and resided there.

source: རང་སངས་རྒྱས་དེ་དག་ཀྱང་མྱ་ངན་ལས་འདས་ནས་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་དྲང་སྲོང་ཁྲི་གནས་པར་གྱུར་ཏོ།
en: When those solitary buddhas had also passed into nirvāṇa, ten thousand sages who were endowed with the five forms of superknowledge came to inhabit the place.

source: །འདིར་ནི་བཙུན་པ་རབ་མཐོང་ཆེན་པོ་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་བརྒྱ་ཐུབ་པ་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: “Now, honorable great Pradarśa, during this very Excellent Eon when the lifespan of humans is one hundred years, the perfect Buddha Śākyamuni has appeared in the world.

source: འཕགས་པ་རབ་མཐོང་ཆེན་པོ་ཁྱོད་ལྷ་དང་མིས་མཆོད་པའི་མཆོག་ཏུ་གྱུར་པ་ཡང་འདི་ཉིད་ནའོ།
en: You, noble and great Pradarśa, the monk most highly revered by gods and humans, will reside in that very place.

source: །མཚམས་ཀྱི་རི་ལ་རྩྭའི་རིགས་ཨུ་ཤི་ཤ་སྐྱེ་བས་ཨུ་ཤིའི་རི་ཞེས་བཏགས་པར་གྱུར།
en: Because the bordering mountain has vetiver grass growing on it, it is called Mount Uśīra.

source: ཀླུ་མོ་ཏ་མ་ཞེས་བྱ་བ་གནས་པས་ཏ་མའི་ནགས་ཚལ་ཞེས་བཏགས་པར་གྱུར།
en: The forest is called Gloomy Forest because the nāga lady Gloom resides there.

source: ཤིང་ཨ་མྲ་སྐྱེ་བས་ཨ་མྲའི་ཕུག་ཅེས་ད་ལྟར་བཏགས་པ་ཡིན་ཏེ།
en: Because mango trees grow nearby, the caves are called Mango Caves.

source: བཙུན་པ་རབ་མཐོང་ཆེན་པོ་ཨུ་ཤི་ཤའི་རི་བྲག་འདི་ཉིད་དུ་ཐུགས་བརྩེ་བར་དགོངས་ཏེ་བཞུགས་པ་ནི་ལེགས་སོ།
en: Honorable great Pradarśa, it would be good if you, thinking compassionately, were to reside on that very Mount Uśīra.”

source: །དེ་ནས་ཡང་ཚངས་པ་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། འཇིག་རྟེན་སྐྱོང་བ་དག་གིས་གནས་བརྟན་ཆེན་པོའི་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་ཐལ་མོ་སྦྱར་བ་བྱས་ནས་རབ་ཏུ་གུས་པས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: At this point Brahmā, Śakra who is chief of the gods, and the Guardians of the World bowed at the feet of the great elder.

source: །ཐུགས་བརྩེ་བ་ཅན་ནགས་འདི་ནི་གཤེགས་ཤིང་བཞུགས་པའི་གནས་ཡིན་ཏེ།
en: Joining their hands together, they respectfully addressed him, “O compassionate one, this forest is a place to which you should come and reside.

source: བདག་ཅག་ཀྱང་ཉེ་གནས་བགྱིད་ལ་གཞན་དག་ཀྱང་གཟུང་དུ་གསོལ།
en: Please let us be your disciples, and please accept others as well.

source: དེ་ནི་སྙན་པར་གྲགས་ཤིང་ལེགས་ཏེ་ཆུ་ནི་གཟིགས་པར་དབྱུང་བར་འཚལ་ལོ་ཞེས་གསོལ་བ་བཏབ་པོ།
en: This forest is praiseworthy and excellent. Please consider the water and extract it!”

source: །གཞན་ཡང་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་བརྒྱད་པོ་འདི་དག་སྟེ། སིང་ག་ལ་ཞེས་བྱ་བ་དང་། ཆོས་སྐྱོང་ཞེས་བྱ་བ་དང་། དོན་གྲུབ་ཅེས་བྱ་བ་དང་། གཞན་ལས་རྒྱལ་ཞེས་བྱ་བ་དང་། གླང་རྣ་ཞེས་བྱ་བ་དང་། དབྱིག་རྣ་བ་ཞེས་བྱ་བ་དང་། ཆོས་ལྡན་ཞེས་བྱ་བ་དང་། ཆོས་འཕགས་ཞེས་བྱ་བས་ཀྱང་གནས་བརྟན་ཆེན་པོའི་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་ཐལ་མོ་སྦྱར་ནས་རབ་ཏུ་གུས་པས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then the eight yakṣa generals—namely, Siṅgala, Dharma Protector, Successful, Victorious , Bull Ear, Jewel Ear, Dharma Endowed , and Uplifted by Dharma —also bowed at the feet of the great elder. Joining their hands together, they respectfully addressed him:

source: །ཐུགས་བརྩེ་བ་ཅན་ནགས་དེ་ནི་གཤེགས་ཤིང་བཞུགས་པའི་གནས་ཡིན་ཏེ་བདག་ཅག་ཀྱང་ཉེ་གནས་བགྱིད་ལ་གཞན་དག་ཀྱང་གཟུང་དུ་གསོལ།
en: “O compassionate one, this forest is a place to which you should come and reside. Please let us be your disciples, and please accept others as well.

source: དེ་ནི་སྙན་པར་གྲགས་ཤིང་ལེགས་ཏེ་ཆུ་ནི་གཟིགས་པར་དབྱུང་བར་འཚལ་ལོ་ཞེས་གསོལ་བ་བཏབ།
en: This forest is praiseworthy and excellent. Please consider the water and extract it!”

source: །གཞན་ཡང་གནོད་སྦྱིན་མ་ཆེན་མོ་བརྒྱད་འདི་དག་སྟེ། ཨ་ཤི་ཌི་ཞེས་བྱ་བ་དང་། བུ་མངས་ཞེས་བྱ་བ་དང་། འཕྱང་མ་ཞེས་བྱ་བ་དང་། རབ་ཏུ་འཕྱང་མ་དང་། དྲག་མོ་ཞེས་བྱ་བ་དང་། གཏུམ་མོ་ཞེས་བྱ་བ་དང་། མདུང་ཐུང་འཛིན་ཅེས་བྱ་བ་དང་། བར་སྣང་མ་ཞེས་བྱ་བས་ཀྱང་གནས་བརྟན་ཆེན་པོའི་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་ཐལ་མོ་སྦྱར་བ་བྱས་ནས་རབ་ཏུ་གུས་པས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then the eight great yakṣīs—namely, Aśiḍi, Many Sons, Hanging Down, Fully Hanging, Terrible Lady, Fierce Lady, Small Club Holder, and Sky Dweller—also bowed at the feet of the great elder. Joining their hands together, they respectfully addressed him:

source: །ཐུགས་བརྩེ་བ་ཅན་ནགས་དེ་ནི་གཤེགས་ཤིང་བཞུགས་པའི་གནས་ཡིན་ཏེ།
en: “O compassionate one, this forest is a place to which you should come and reside.

source: །དེ་བཞིན་དུ་གཞན་ཡང་ཀླུ་ཆེན་པོ་བརྒྱད་པོ་འདི་དག་སྟེ། སེར་སྐྱ་ཞེས་བྱ་བ་དང་། དྲི་མ་ཞེས་བྱ་བ་དང་། ཆུ་ལྡན་ཞེས་བྱ་བ་དང་། དྲག་ཤུལ་ཞེས་བྱ་བ་དང་། ལྷའི་བང་རིམ་ཞེས་བྱ་བ་དང་། བུམ་པའི་བང་རིམ་ཞེས་བྱ་བ་དང་། ཉེ་བའི་ཀླུ་ཞེས་བྱ་བ་དང་། ཨོ་ཌ་སུ་ཏ་ཞེས་བྱ་བས་ཀྱང་གནས་བརྟན་ཆེན་པོའི་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ།
en: Similarly, the eight great nāgas—namely, Tawny, Scent, Watery, Wrathful, Staircase to Heaven, Staircase to a Vase, Nearby Nāga, and Oḍasuta—also bowed at the feet of the great elder.

source: ཐལ་མོ་སྦྱར་བ་བྱས་ནས་རབ་ཏུ་གུས་པས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Joining their hands together, they respectfully addressed him:

source: དེ་ནི་སྙན་པར་གྲགས་ཤིང་ལེགས་ཏེ།
en: This forest is praiseworthy and excellent.

source: ཆུ་ནི་གཟིགས་པར་དབྱུང་བར་འཚལ་ལོ་ཞེས་གསོལ་བ་བཏབ་པོ།
en: Please consider the water and extract it!”

source: །གཞན་ཡང་ཀླུ་མོ་བརྒྱད་པོ་འདི་དག་སྟེ། །མུན་ཞེས་བྱ་བ་དང་། འགྲོ་འདོད་ཅེས་བྱ་བ་དང་། མཐོང་མོ་ཞེས་བྱ་བ་དང་། གྲང་མོ་ཞེས་བྱ་བ་དང་། ཁུར་དྲང་མོ་ཞེས་བྱ་བ་དང་། ལབ་འཐོར་མ་ཞེས་བྱ་བ་དང་། སྣ་ཚོགས་སྡེ་ཞེས་བྱ་བ་དང་། དྲི་ཟ་མོ་ཞེས་བྱ་བ་དག་གིས་ཀྱང་གནས་བརྟན་ཆེན་པོའི་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ།
en: Similarly, the eight nāga ladies—namely, Darkness, Eager to Leave, Seer, Cool, Load Carrying, Speech Strewing, Universal Army, and Gandharva Lady—also bowed at the feet of the great elder.

source: དེ་ནི་སྙན་པར་གྲགས་ཤིང་ལེགས་ཏེ་ཆུ་ནི་གཟིགས་པར་དབྱུང་བར་འཚལ་ལོ་ཞེས་གསོལ་བ་བཏབ་པ་དང་། ཚེ་དང་ལྡན་པ་རབ་མཐོང་ཆེན་པོས་ཅང་མི་སྨྲ་བར་དང་དུ་བླངས་སོ།
en: This forest is praiseworthy and excellent. Please consider the water and extract it!” The venerable great Pradarśa, by remaining quiet, consented to this request.
